
#ifndef __DEBUG_CTRL__
#define __DEBUG_CTRL__

/**********************************************************************************
    网络版调试版本总开关,控制"单机版"入口
    0 单机版
    1 网络版
    2 其他功能入口
**********************************************************************************/
#define DEBUG_ENTRANCE 2

/**********************************************************************************
    网络版SERVER IP
        本机windows调试，   127.0.0.1
        手机调试版本，      本机局域网ip
        windows联调版本     实际的server ip
**********************************************************************************/
#define DBG_LAN_SERVER "127.0.0.1"
#define DBG_LOGIN_PORT 60905


/* 不发送RequestLogin - 本地服务器仅支持一个sockect连接 */
//#define IGNORE_LOGIN_REQUEST

/* 使用预先设置好的牌局 - 单机版测试 */
//#define USE_TEST_ROUND

/* 倒计时超时不强制出牌 */
#define TIMER_FREE

/* 不发送心跳 */
#define NO_HEART_BEAT

#endif

